
BOT_TOKEN = '5703032509:AAGbUu378C8wUa3RYbTLSO9LkeTFLAXZcW4'      # Токен бота

CODE_ACCESS = 'TEST'    # код по которому можно будет давать доступ в итоге код получится TESTГОД-МЕСЯЦ-ЧИСЛО (TEST2020-01-01)

BOT_LOGIN = 'TrCrypt_bot'          # login бота, например: telegram_bot

ADMIN_ID = '107351195'     # id админа

QIWI_NUMBER = '+79047640010'    
QIWI_TOKEN = '83c243e8efb766787dfa5807d4bf89e1' 

ACCESS_COST = 10           # стоимость доступа
MIN_PAYOUT = 2.0           # минимальная сумма для запроса на вывод денег

PERCENT_ADMIN = 0.25        # сколько процентов от стоимости доступа пойдёт вам(0.25 от 200 рублей это 50 руб)
PERCENT_1 = 0.375           # сколько пойдёт пригл. пользователя (0.375 от 200 руб это 75 руб)
PERCENT_2 = 0.225           # сколько пойдёт 2 лвл пользователя (0.225 от 200 руб это 45 руб)
PERCENT_3 = 0.15            # сколько пойдёт 3 лвл пользователя (0.15 от 200 руб это 30 руб)

