import settings

balance_user_rep = '✅ Ваш баланс пополнен'


start_menu = '👋 Приветствую, {name}\n' \
        '❗️Ваш id в системе - {id}\n' \
        '❗️Вы находитесь в меню:'


admin_menu = '👋 Приветствую, {name}\n' \
             '❗️Вы находитесь в панели администрации: '

access_no_info = '❗️Информаци о системе\n\n' \
                 '❗️Система имеет 2-х уровневую реферальную логику\n' \
                 '❗️В системе существует 6 уровней столов с разной суммой доступа\n' \
                 '❗️Получая доступ вы активируете личную ссылку для приглашения пользователей\n' \
                 '❗️Вам необходимо собрать 2 уровня рефералов в системе чтобы начать зарабатывать\n' \
                 '❗️Количество рефералов 1-го уровня на столе не должно превышать 2-х\n' \
                 '❗️Количество рефералов 2-го уровня не должно превышать 4-х\n' \
                 '❗️За первого приглашенного реферала 2 уровня вы получаете 100 % от его оплаты\n' \
                 '❗️Сумма от оплаты остальных рефералов 2-го уровня открывает вам доступ к столу следующего уровня\n' \
                 '❗️После того как стол будет закрыт вы переходите на следующий уровень\n'
                 


access_yes_info = '🙎‍♂️Ваша информация в системе\n\n' \
                  '❗️Ваша реферальная ссылка: {ref_url}\n\n' \
                  #'❗️Доступные средства на вывод: {user_profit} USDT\n' #\
                  #'❗️Количество приглашенных людей - {amount_invite_users}'
                  
def_test = 'Здесь может быть ваша функция'

back = 'Вы были возвращены в меню'
