import settings

balance_user_rep = '✅ Ваш баланс пополнен'


start_menu = '👋 Приветствую, {name}\n' \
        '❗️Ваш id в системе - {id}\n' \
        '❗️Вы находитесь в меню:'


admin_menu = '👋 Приветствую, {name}\n' \
             '❗️Вы находитесь в панели администрации: '

access_no_info = '❗️Информаци о системе\n\n' \
                 '❗️Система имеет 2-х уровневую реферальную логику\n' \
                 '❗️В системе существует 6 уровней столов с разной суммой доступа\n' \
                 '❗️Получая доступ вы активируете личную ссылку для приглашения пользователей\n' \
                 '❗️Вам необходимо собрать 2 уровня рефералов в системе чтобы начать зарабатывать\n' \
                 '❗️Количество рефералов 1-го уровня на столе не должно превышать 2-х\n' \
                 '❗️Количество рефералов 2-го уровня не должно превышать 4-х\n' \
                 '❗️За первого приглашенного реферала 2 уровня вы получаете 100 % от его оплаты\n' \
                 '❗️Сумма от оплаты остальных рефералов 2-го уровня открывает вам доступ к столу следующего уровня\n' \
                 '❗️После того как стол будет закрыт вы переходите на следующий уровень\n'
                 


access_yes_info = '🙎‍♂️Ваша информация в системе\n\n' \
                  '❗️Ваша реферальная ссылка: {ref_url}\n\n' \
                  #'❗️Доступные средства на вывод: {user_profit} USDT\n' #\
                  #'❗️Количество приглашенных людей - {amount_invite_users}'
                  
def_test = 'Здесь может быть ваша функция'

back = 'Вы были возвращены в меню'




about_company = 'Привет! Мы - кампания pepe pizza 🍕\n\n' \
                  'Мы работаем и приносим хорошее настроение людям с 2003 года 😃\n\n' \
                  'Если ты читаешь это - значит ты либо будущий, либо действующий наш сотрудник\n\n' \
                  'Этот телеграм-бот поможет тебе во всём разобраться - у кого какие обязанности, в базе знаний ты можешь узнать какие у нас действующие стандарты, проверить себя с помощью теста, и многое другое!\n\n' \
                  'Для продолжения, выбери кем ты являешься - действующим или потенциальным сотрудником нашей пиццерии 😉\n\n' \
                  
about_pizzamaker = 'Информация о должности пиццамейкера 🍕\n\n' \
                  'В твои обязанности входит:\n\n' \
                  '• Приходить вовремя 😉\n\n' \
                  '• Знать рецепты всех пицц и закусок 🍕\n\n' \
                  '• Следить за сроками годности продукции и за соблюдением стандартов качества 😃\n\n' \
                  
about_cassir = 'Информация о должности кассира 💸\n\n' \
                  'В твои обязанности входит:\n\n' \
                  '• Приходить вовремя 😉\n\n' \
                  '• Знать рецепты всех пицц и закусок 🍕\n\n' \
                  '• Уметь общаться с клиентами и находить компромиссы в непредвиденных ситуациях 😃\n\n' \
                  
about_manager = 'Информация о должности менеджера 🤓\n\n' \
                  'В твои обязанности входит:\n\n' \
                  '• Приходить вовремя 😉\n\n' \
                  '• Знать рецепты всех пицц и закусок 🍕\n\n' \
                  '• Уметь управлять сменой - заполнять отчеты, следить за выполнением чужих обязанностей, уметь справляться с проблемами 😃\n\n' \
                  
about_teacher = 'Информация о должности инструктора 📖\n\n' \
                  'В твои обязанности входит:\n\n' \
                  '• Приходить вовремя 😉\n\n' \
                  '• Знать рецепты всех пицц и закусок 🍕\n\n' \
                  '• Уметь обучать стажеров для дальнейшего их становления полноценными работниками 🤓\n\n' \
                  